define('widget/citySelect:data', function(){
	return [{"n":"北京","nid":"110000","c":["北京市"],"pid":["110001"]},
{"n":"天津","nid":"120000","c":["天津市"],"pid":["120001"]},
{"n":"河北","nid":"130000","c":["石家庄","唐山","秦皇岛","邯郸","邢台","保定","张家口","承德","沧州","廊坊","衡水"],"pid":["130100","130200","130300","130400","130500","130600","130700","130800","130900","131000","131100"]},
{"n":"山西","nid":"140000","c":["太原","大同","阳泉","长治","晋城","朔州","晋中","运城","忻州","临汾","吕梁"],"pid":["140100","140200","140300","140400","140500","140600","140700","140800","140900","141000","141100"]},
{"n":"内蒙古","nid":"150000","c":["呼和浩特","包头","乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","乌兰察布","兴安","锡林郭勒","阿拉善"],"pid":["150100","150200","150300","150400","150500","150600","150700","150800","150900","152200","152500","152900"]},
{"n":"辽宁","nid":"210000","c":["沈阳","大连","鞍山","抚顺","本溪","丹东","锦州","营口","阜新","辽阳","盘锦","铁岭","朝阳","葫芦岛"],"pid":["210100","210200","210300","210400","210500","210600","210700","210800","210900","211000","211100","211200","211300","211400"]},
{"n":"吉林","nid":"220000","c":["长春","吉林","四平","辽源","通化","白山","松原","白城","延边"],"pid":["220100","220200","220300","220400","220500","220600","220700","220800","222400"]},
{"n":"黑龙江","nid":"230000","c":["哈尔滨","齐齐哈尔","鸡西","鹤岗","双鸭山","大庆","伊春","佳木斯","七台河","牡丹江","黑河","绥化","大兴安岭"],"pid":["230100","230200","230300","230400","230500","230600","230700","230800","230900","231000","231100","231200","232700"]},
{"n":"上海","nid":"310000","c":["上海市"],"pid":["310001"]},
{"n":"江苏","nid":"320000","c":["南京","无锡","徐州","常州","苏州","南通","连云港","淮安","盐城","扬州","镇江","泰州","宿迁"],"pid":["320100","320200","320300","320400","320500","320600","320700","320800","320900","321000","321100","321200","321300"]},
{"n":"浙江","nid":"330000","c":["杭州","宁波","温州","嘉兴","湖州","绍兴","金华","衢州","舟山","台州","丽水"],"pid":["330100","330200","330300","330400","330500","330600","330700","330800","330900","331000","331100"]},
{"n":"安徽","nid":"340000","c":["合肥","芜湖","蚌埠","淮南","马鞍山","淮北","铜陵","安庆","黄山","滁州","阜阳","宿州","六安","亳州","池州","宣城"],"pid":["340100","340200","340300","340400","340500","340600","340700","340800","341000","341100","341200","341300","341500","341600","341700","341800"]},
{"n":"福建","nid":"350000","c":["福州","厦门","莆田","三明","泉州","漳州","南平","龙岩","宁德"],"pid":["350100","350200","350300","350400","350500","350600","350700","350800","350900"]},
{"n":"江西","nid":"360000","c":["南昌","景德镇","萍乡","九江","新余","鹰潭","赣州","吉安","宜春","抚州","上饶"],"pid":["360100","360200","360300","360400","360500","360600","360700","360800","360900","361000","361100"]},
{"n":"山东","nid":"370000","c":["济南","青岛","淄博","枣庄","东营","烟台","潍坊","济宁","泰安","威海","日照","莱芜","临沂","德州","聊城","滨州","菏泽"],"pid":["370100","370200","370300","370400","370500","370600","370700","370800","370900","371000","371100","371200","371300","371400","371500","371600","371700"]},
{"n":"河南","nid":"410000","c":["郑州","开封","洛阳","平顶山","安阳","鹤壁","新乡","焦作","濮阳","许昌","漯河","三门峡","南阳","商丘","信阳","周口","驻马店","济源"],"pid":["410100","410200","410300","410400","410500","410600","410700","410800","410900","411000","411100","411200","411300","411400","411500","411600","411700","419001"]},
{"n":"湖北","nid":"420000","c":["武汉","黄石","十堰","宜昌","襄阳","鄂州","荆门","孝感","荆州","黄冈","咸宁","随州","恩施","仙桃","潜江","天门","神农架林"],"pid":["420100","420200","420300","420500","420600","420700","420800","420900","421000","421100","421200","421300","422800","429004","429005","429006","429021"]},
{"n":"湖南","nid":"430000","c":["长沙","株洲","湘潭","衡阳","邵阳","岳阳","常德","张家界","益阳","郴州","永州","怀化","娄底","湘西"],"pid":["430100","430200","430300","430400","430500","430600","430700","430800","430900","431000","431100","431200","431300","433100"]},
{"n":"广东","nid":"440000","c":["广州","韶关","深圳","珠海","汕头","佛山","江门","湛江","茂名","肇庆","惠州","梅州","汕尾","河源","阳江","清远","东莞","中山","潮州","揭阳","云浮"],"pid":["440100","440200","440300","440400","440500","440600","440700","440800","440900","441200","441300","441400","441500","441600","441700","441800","441900","442000","445100","445200","445300"]},
{"n":"广西","nid":"450000","c":["南宁","柳州","桂林","梧州","北海","防城港","钦州","贵港","玉林","百色","贺州","河池","来宾","崇左"],"pid":["450100","450200","450300","450400","450500","450600","450700","450800","450900","451000","451100","451200","451300","451400"]},
{"n":"海南","nid":"460000","c":["海口","三亚","三沙","五指山","琼海","儋州","文昌","万宁","东方","定安","屯昌","澄迈","临高","白沙","昌江","乐东","陵水","保亭","琼中"],"pid":["460100","460200","460300","469001","469002","469003","469005","469006","469007","469021","469022","469023","469024","469025","469026","469027","469028","469029","469030"]},
{"n":"重庆","nid":"500000","c":["重庆市"],"pid":["500001"]},
{"n":"四川","nid":"510000","c":["成都","自贡","攀枝花","泸州","德阳","绵阳","广元","遂宁","内江","乐山","南充","眉山","宜宾","广安","达州","雅安","巴中","资阳","阿坝","甘孜","凉山"],"pid":["510100","510300","510400","510500","510600","510700","510800","510900","511000","511100","511300","511400","511500","511600","511700","511800","511900","512000","513200","513300","513400"]},
{"n":"贵州","nid":"520000","c":["贵阳","六盘水","遵义","安顺","毕节","铜仁","黔西南","黔东南","黔南"],"pid":["520100","520200","520300","520400","520500","520600","522300","522600","522700"]},
{"n":"云南","nid":"530000","c":["昆明","曲靖","玉溪","保山","昭通","丽江","普洱","临沧","楚雄","红河","文山","西双版纳","大理","德宏","怒江","迪庆"],"pid":["530100","530300","530400","530500","530600","530700","530800","530900","532300","532500","532600","532800","532900","533100","533300","533400"]},
{"n":"西藏","nid":"540000","c":["拉萨","昌都","山南","日喀则","那曲","阿里","林芝"],"pid":["540100","542100","542200","542300","542400","542500","542600"]},
{"n":"陕西","nid":"610000","c":["西安","铜川","宝鸡","咸阳","渭南","延安","汉中","榆林","安康","商洛"],"pid":["610100","610200","610300","610400","610500","610600","610700","610800","610900","611000"]},
{"n":"甘肃","nid":"620000","c":["兰州","嘉峪关","金昌","白银","天水","武威","张掖","平凉","酒泉","庆阳","定西","陇南","临夏","甘南"],"pid":["620100","620200","620300","620400","620500","620600","620700","620800","620900","621000","621100","621200","622900","623000"]},
{"n":"青海","nid":"630000","c":["西宁","海东","海北","黄南","海南","果洛","玉树","海西"],"pid":["630100","632100","632200","632300","632500","632600","632700","632800"]},
{"n":"宁夏","nid":"640000","c":["银川","石嘴山","吴忠","固原","中卫"],"pid":["640100","640200","640300","640400","640500"]},
{"n":"新疆","nid":"650000","c":["乌鲁木齐","克拉玛依","吐鲁番","哈密","昌吉","博尔塔拉","巴音郭楞","阿克苏","克孜勒苏柯尔克孜","喀什","和田","伊犁哈萨克","塔城","阿勒泰","石河子","阿拉尔","图木舒克","五家渠"],"pid":["650100","650200","652100","652200","652300","652700","652800","652900","653000","653100","653200","654000","654200","654300","659001","659002","659003","659004"]}];
});
define('widget/citySelect', function(){
	return function(options){
		var elem = {}, data = require('widget/citySelect:data'), itemMap = {province: '省份', city: '城市', district: '区县'}, tpl = [];
		options = $.extend({}, {
			provinceSelector: '#CS_province',
			citySelector: '#CS_city',
			districtSelector: '#CS_district',
			init: function(data, elem, options){
				var i = 0, len = 0, p = [], c, d, u, z, tpl = '<option data-index="-1" value="-1">--请选择{name}--</option>';
				for(len = data.length; i < len; i++){
					p.push('<option data-index="' + i + '" value="' + data[i].nid + '"');
					if( data[i].nid==options.initProvince ){
						p.push(' selected');
						u = data[i];
					}
					p.push('>' + data[i].n + '</option>');
				}
				elem.province.html(tpl.replace('{name}', itemMap.province) + p.join(''));
				if( options.initCity && u ){
					c = [];
					for(i = 0, len = u.c.length; i < len; i++){
						c.push('<option data-index="' + i + '" value="' + u.pid[i] + '"');
						if( u.pid[i]==options.initCity ){
							c.push(' selected');
							z = u.pid[i];
						}
						c.push('>' + u.c[i] + '</option>');
					}
					elem.city.html(tpl.replace('{name}', itemMap.city) + c.join(''));
					c.length = u.length = 0;
				}
				if( options.initDistrict && z ){
					getDistrict(z);
				}
				elem.province.change(function(){
					var index = 0, list, t = [];
					$(this).find('option').each(function(){
						if( this.selected ){
							index = $(this).attr('data-index');
							return false;
						}
					});
					list = data[index];
					if( typeof list != 'object' && !list.c ) return;
					for(var i = 0, len = list.c.length; i < len; i++){
						t.push('<option data-index="' + i + '" value="' + list.pid[i] + '">' + list.c[i] + '</option>');
					}
					elem.city.html(tpl.replace('{name}', itemMap.city) + t.join(''));
					elem.district.html(tpl.replace('{name}', itemMap.district));
				});
				elem.city.change(function(){
					var pid = 0;
					$(this).find('option').each(function(){
						if( this.selected ){
							pid = this.value;
							return false;
						}
					});
					if( pid == -1 ){
						elem.district.html(tpl, 'district');
					}

					getDistrict(pid, 'district');
				});

				function getDistrict(pid, type){
					if( pid < 0 ) return;
					QY.util.request({
						type: 'GET',
						url: QY.domain.base + '/home/getLocallist',
						data: {pid: pid},
						success: function(response){
							var i = 0, list = response.msg, len = list.length, d = [];
							if( response.code == 1 ){
								for(; i < len; i++){
									d.push('<option value="' + list[i].area_id + '"' + (options.initDistrict==list[i].area_id?' selected': '') + '>' + list[i].name + '</option>');
								}
								elem.district.html(tpl.replace('{name}', itemMap[type]) + d.join(''));
							} else {
								QY.util.error(list);
							}
						}
					});
				}
			}
		}, options);
		elem.province = $(options.provinceSelector);
		elem.city = $(options.citySelector);
		elem.district = $(options.districtSelector);

		options.init(data, elem, options);
	};
});